using Microsoft.AspNetCore.Http;
using Microsoft.AspNetCore.Mvc;
using Microsoft.EntityFrameworkCore;
using ClosedXML.Excel;
using System.IO;
using System.Linq;
using System.Threading.Tasks;
using WebApplication1.Models;
using ExcelDataReader;

public class HomeController : Controller
{
    private readonly ILogger<HomeController> _logger;
    private readonly WebContext _context;

    public HomeController(ILogger<HomeController> logger, WebContext context)
    {
        _logger = logger;
        _context = context;
    }

    public IActionResult Index()
    {
        return View();
    }

    private readonly List<string> knownManagers = new List<string>
    {
        "БАРАТИНСЬКИЙ ВАДИМ МИКОЛАЙОВИЧ", "ГУЗЕНКО РУСЛАН ІВАНОВИЧ", "КАЗАКОВ ЮРІЙ ВАЛЕНТИНОВИЧ",
        "КУЛИК ВОЛОДИМИР ВАСИЛЬОВИЧ", "НІКІТІНА ЄВГЕНІЯ МИКОЛАЇВНА",
        "РЯЖЕВА НАТАЛІЯ АНАТОЛІЇВНА", "СОКОЛОВА ІРИНА ОЛЕКСАНДРІВНА",
        "СУДИКА ВАЛЕРІЙ ВІКТОРОВИЧ", "ТИСЯЧНИЙ ВІКТОР МИКОЛАЙОВИЧ",
        "ЩУР ВІКТОР ПЕТРОВИЧ", "ШЕВЧЕНКО О.В"
    };

    [HttpPost]
    public async Task<IActionResult> UploadFile(IFormFile file)
    {
        if (file == null || file.Length == 0)
        {
            ViewBag.Message = "Please select a valid file.";
            return View("Index");
        }

        var uploadPath = Path.Combine(Directory.GetCurrentDirectory(), "wwwroot", "uploads");
        if (!Directory.Exists(uploadPath))
        {
            Directory.CreateDirectory(uploadPath);
        }

        var filePath = Path.Combine(uploadPath, file.FileName);

        using (var stream = new FileStream(filePath, FileMode.Create))
        {
            await file.CopyToAsync(stream);
        }

        ReadExcelAndSaveToDb(filePath);

        ViewBag.Message = "File uploaded and processed successfully.";
        return View("Index");
    }

    private readonly Dictionary<string, (string Place, string Purpose, string DetailedInfo)> managerData = new Dictionary<string, (string, string, string)>
{
    { "БАРАТИНСЬКИЙ ВАДИМ МИКОЛАЙОВИЧ", ("ПП «Абла Центр»", "- консультування з науково-технічних питань: організація та нагляд за проведенням науково-виробничих дослідів в господарствах клієнтів та опрацювання результатів їх проведення; - обстеження стану стада, дезінфікування тваринницьких приміщень з використанням засобів для дезінфекції SHIFT, GPC8, VANOQUAT (для навчання персоналу.", "ФОП  Баратинський Вадим Миколайович  \r\nІдентифікаційний номер: 2805208433\r\nр/р 26005054308944\r\nр/р 26058054307668\r\nв Южне ГРУ ПАТ «КОМЕРЦІЙНИЙ БАНК «ПРИВАТБАНК» МФО: 328704\r\nНомер запису в ЄДР 2 544 000 0000 004085 від 15.07.2013 р. \r\nПлатник єдиного податку 3 група ставка 5%.\r\nАдреса: 67400, Одеська обл.,\r\nРоздільнянський р-н, м. Роздільна, \r\nвул. Димитрова, буд. 85, кв. 1\r\n") },
    { "ГУЗЕНКО РУСЛАН ІВАНОВИЧ", ("ТОВ «Агромайстер», ТДВ «Агронива», ТОВ «Віола+»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; розробка рецептур кормів на базі преміксів ТОВ «Текро» і кормової бази господарства; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин.", "ФОП  Гузенко Руслан Іванович\r\nР/р 26006060370261 в КБ «Приватбанк» \r\nМФО 305299, ІН 3052306778 \r\nЗапис про державну реєстрацію ФОП  № 2 218 000 0000 001031 від 02.11.2010 р.\r\nАдреса: 53500, Дніпропетровська обл., Томаківський р-н, смт Томаківка, пров. Робітничий, 12\r\n") },
    { "КАЗАКОВ ЮРІЙ ВАЛЕНТИНОВИЧ", ("ТОВ «АВ «Агроцентр-К»", "- консультування з науково-технічних питань: організація та нагляд за проведенням науково-виробничих дослідів в господарствах клієнтів та опрацювання результатів їх проведення; - обстеження стану стада, дезінфікування тваринницьких приміщень з використанням засобів для дезінфекції SHIFT, GPC8, VANOQUAT (для навчання персоналу).", "ФОП  Казаков Юрій Валентинович\r\nр/р 26005011000327 в ПАТ «КРЕДОБАНК» МФО 325365\r\nДата та номер запису про проведення державної реєстрації: 25.09.2007, № 2 471 000 0000 063995 \r\nІдентифікаційний номер 2428501299\r\nАдреса: 62404, Харківска обл., Харківський  р-н., смт. Кулиничі, вул. Ювілейна, буд. 2-В, кв. 67\r\n") },
    { "КУЛИК ВОЛОДИМИР ВАСИЛЬОВИЧ", ("Філія «Броварська» ПНВК «Інтербізнес»", "- консультування з науково-технічних питань: організація та нагляд за проведенням науково-виробничих дослідів в господарствах клієнтів та опрацювання результатів їх проведення; - обстеження стану стада, дезінфікування тваринницьких приміщень з використанням засобів для дезінфекції SHIFT, GPC8, VANOQUAT (для навчання персоналу).", "ФОП  Кулик Володимир Васильович\r\nр/р 260581861 в Житомирській ОД Райффайзен банку «Аваль», Попільнянське відділення, МФО 311528  \r\nІдентифікаційний номер 1821810275\r\nЗапис про державну реєстрацію СПД-фізичної особи № 2 297 000 0000 001485 від 8 липня 2008 р. \r\nАдреса: 13502, Житомирська обл., Попільнянський р-н, вул. Лесі Українки, 36\r\n") },
    { "НІКІТІНА ЄВГЕНІЯ МИКОЛАЇВНА", ("Філія «Броварська» ПНВК «Інтербізнес»", "- консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин; організація та нагляд за проведенням науково-виробничих дослідів в господарствах клієнтів та опрацювання результатів їх проведення.", "ФОП  Нікітіна Євгенія Миколаївна\r\nр/р: 2600847087 в КРД АТ «РАЙФФАЙЗЕН БАНК АВАЛЬ», м. Київ\r\nМФО 322904\r\nІН 2890109768\r\nАдреса: 07400, Київська обл., м. Бровари, вул. Симоненка Василя, 4, кв. 92\r\n") },
    { "РЯЖЕВА НАТАЛІЯ АНАТОЛІЇВНА", ("ТОВ «Чернігівська м’ясна компанія», ТОВ «Українська вольниця», ПАП «Фортуна»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; розробка рецептур кормів на базі преміксів ТОВ «Текро» і кормової бази господарства; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі.", "ФОП  Ряжева Наталія Анатоліївна \r\nІН 2681213028\r\nСв-во про державну реєстрацію СПД-фізичної особи від 24.10.2007 р., запис № 2 544 000 0000 002094 \r\nАдреса: 67400, Одеська обл., Роздільнянський р-н., м. Роздільна, вул. Леніна, буд. 109-А, кв. 18\r\n") },
    { "СОКОЛОВА ІРИНА ОЛЕКСАНДРІВНА", ("ТДВ «Колос»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; розробка рецептур кормів на базі преміксів ТОВ «Текро» і кормової бази господарства; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин; організація та нагляд за проведенням науково-виробничих дослідів в господарствах клієнтів та опрацювання результатів їх проведення.", "ФОП Соколова Ірина Олександрівна \r\n61174, Харківська обл., місто Харків, вул. Домобудівельна, будинок 11, квартира 156\r\nІдентифікаційний номер: 3223517141 \r\nр/р 26005052153402\r\nр/рIBAN: UA733515330000026005052153402\r\nДата запису про державну реєстрацію: 22.12.2017\r\nНомер запису: 2 247 000 0000 002313\r\nПлатник єдиного податку 3 група 5%.\r\n") },
    { "СУДИКА ВАЛЕРІЙ ВІКТОРОВИЧ", ("ТОВ «Золота Роса Агро»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; консультування з підбору кормів для селекції та відтворення тварин; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин.", "ФОП  Судика Валерій Вікторович  \r\nІН 2709409836\r\nДата запису про державну реєстрацію: 06.12.2017\r\nНомер запису: 2 353 000 0000 038727\r\nПлатник єдиного податку 3 група.\r\nАдреса: 09100, Київська обл., м. Біла Церква, \r\nвул. Шевченка, буд. 95, кв. 72.\r\n") },
    { "ТИСЯЧНИЙ ВІКТОР МИКОЛАЙОВИЧ", ("ФГ «Плантера»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; розробка рецептур кормів на базі преміксів ТОВ «Текро» і кормової бази господарства; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин.", "ФОП  Тисячний Віктор Миколайович \r\nІН 2922708036\r\nСв-во про державну реєстрацію СПД-фізичної особи Серія В03 № 884993 від 30.11.2010 р., запис № 2 170 000 0000 000822\r\nАдреса: 24120, Вінницька обл., Чернівецький р-н, с.Володіївці, вул. Миру, 21\r\n") },
    { "ЩУР ВІКТОР ПЕТРОВИЧ", ("ТОВ «Віола+»", "- консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин.", "ФОП  Щур Віктор Петрович\r\nІПН 2204610657\r\nР/р 2600812615 в ВОД АППБ “Аваль”, \r\nм. Бершадь, Вінницька обл., МФО 302247\r\nСв-во про реєстрацію СПД – ф.о. № 1696 від 15 березня 2004 р.\r\nАдреса: 24400, Вінницька обл., Бершадський р-н, м. Бершадь, вул. Лесі Українки, буд. 21\r\n") },
    { "ШЕВЧЕНКО О.В.", ("ПП «Абла-Центр»", "- для підвищення продуктивності тварин: аналіз кормової бази господарства; визначення раціону кормів, збалансованих за енергією, вмістом білків, жирів, вітамінів і мікроелементів; - консультування з науково-технічних питань: консультування з питань удосконалення технологій утримання тварин та птиці, удосконалення та оптимізація раціонів годівлі; консультування з підбору кормів для селекції та відтворення тварин.", "ФОП  Шевченко Олександр Вікторович\r\nІПН 0000000000\r\nР/р UA 863052990000026009031608516 в АТ КБ «ПриватБанк»\r\n") }
};

    private void ReadExcelAndSaveToDb(string filePath)
    {
        var extension = Path.GetExtension(filePath).ToLower();
        if (extension == ".xls" || extension == ".xlsx")
        {
            using (var stream = System.IO.File.Open(filePath, FileMode.Open, FileAccess.Read))
            {
                System.Text.Encoding.RegisterProvider(System.Text.CodePagesEncodingProvider.Instance);
                using (var reader = ExcelDataReader.ExcelReaderFactory.CreateReader(stream))
                {
                    var result = reader.AsDataSet();
                    var dataTable = result.Tables[0];
                    Manager currentManager = null;

                    for (int row = 0; row < dataTable.Rows.Count; row++)
                    {
                        var cellValue = dataTable.Rows[row][0]?.ToString()?.Trim();
                        if (string.IsNullOrEmpty(cellValue)) continue;

                        if (managerData.ContainsKey(cellValue))
                        {
                            currentManager = new Manager
                            {
                                Name = cellValue,
                                Place = managerData[cellValue].Place,
                                Purpose = managerData[cellValue].Purpose,
                                DetailedInfo = managerData[cellValue].DetailedInfo
                            };
                        }
                        else if (currentManager != null)
                        {
                            var dateString = ExtractDateFromText(cellValue);
                            if (!string.IsNullOrEmpty(dateString) && DateTime.TryParse(dateString, out DateTime date))
                            {
                                decimal? cost = null;
                                if (decimal.TryParse(dataTable.Rows[row][5]?.ToString()?.Trim(), out decimal parsedCost))
                                {
                                    cost = parsedCost;
                                }

                                _context.Managers.Add(new Manager
                                {
                                    Name = currentManager.Name,
                                    Date = date,
                                    Cost = cost,
                                    Place = currentManager.Place,
                                    Purpose = currentManager.Purpose,
                                    DetailedInfo = currentManager.DetailedInfo // Додаємо DetailedInfo
                                });
                            }
                        }
                    }
                }
                _context.SaveChanges();
            }
        }
        else
        {
            throw new ArgumentException("Unsupported file format.");
        }
    }

    private string ExtractDateFromText(string text)
    {
        var dateIndex = text?.IndexOf("от") ?? -1;
        if (dateIndex >= 0)
        {
            var datePart = text.Substring(dateIndex + 3).Trim(); // Cut off "от"
            return datePart;
        }
        return null;
    }

}